In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'player':['messi','cr7','neymer','rooney'],'goals':[102,120,30,50]})

In [3]:
df

   goals  player
0    102   messi
1    120     cr7
2     30  neymer
3     50  rooney

In [4]:
club_map = {'messi':'barca','cr7':'real','neymer':'psg','rooney':'manunited'}

In [5]:
df['club'] = df['player'].map(club_map)

In [6]:
df

   goals  player       club
0    102   messi      barca
1    120     cr7       real
2     30  neymer        psg
3     50  rooney  manunited